Reports/Гражданство.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Report>
		<Properties>
			<Name>Гражданство</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Лига</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лига</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Топ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Команда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Команды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

InformationRegisters/ПеремещенияИгроков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>ПеремещенияИгроков</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Команда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Команды</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Амплуа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Амплуа</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Игрок</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Игроки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Reports/Гражданство/Forms/ФормаОтчетаКоманда/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Команда") Тогда
		ОбщегоНазначения.ЗаголовокСкрыть(ЭтаФорма, Элементы.ФормаКоманднаяПанель);
		Отчет.Команда = Параметры.Команда;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
	Попытка
		СкомпоноватьРезультат();
	Исключение
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	СформироватьНаСервере();
КонецПроцедуры

&НаСервере
Функция РезультатРасшифровки(Расшифровка)
	Возврат СерверныйФункции.ДанныеРасшифровкиПолучитьЗначение(ДанныеРасшифровки, Расшифровка);
КонецФункции

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	Значение	= РезультатРасшифровки(Расшифровка);
	Игроки.ЗагрузитьЗначения(ИгрокиПолучить(Отчет.Команда, Значение));
	Если Игроки.Количество() = 1 Тогда
		НаКлиенте.Показать(Игроки.Получить(0).Значение, СтандартнаяОбработка);
	Иначе
		СтандартнаяОбработка = Ложь;
		Игроки.ПоказатьВыборЭлемента(Новый ОписаниеОповещения("ПослеВыбораИгрока", ЭтотОбъект), "Выберите игрока");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораИгрока(Элемент, ПараметрКоманды=Неопределено) Экспорт
	НаКлиенте.Показать(Элемент);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ИгрокиПолучить(Клуб, Страна)
	Запрос	= Новый Запрос("ВЫБРАТЬ
	      	               |	ПеремещенияИгроков.Игрок КАК Игрок
	      	               |ИЗ
	      	               |	РегистрСведений.ПеремещенияИгроков.СрезПоследних(&Дата, Игрок.Страна = &Страна) КАК ПеремещенияИгроков
	      	               |ГДЕ
	      	               |	ПеремещенияИгроков.Команда = &Команда
	      	               |
	      	               |УПОРЯДОЧИТЬ ПО
	      	               |	Игрок
	      	               |АВТОУПОРЯДОЧИВАНИЕ");
	Запрос.УстановитьПараметр("Команда",			Клуб);
	Запрос.УстановитьПараметр("Страна",				Страна);
	Запрос.УстановитьПараметр("Дата",				НачалоДня(ТекущаяУниверсальнаяДата()));
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку(0);
КонецФункции
